{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В команде биологов a человек, а в команде информатиков — b человек.\n",
    "\n",
    "Нужно заранее разрезать пирог таким образом, чтобы можно было раздать кусочки пирога любой команде, выигравшей соревнование, при этом каждому участнику этой команды должно достаться одинаковое число кусочков пирога. И так как не хочется резать пирог на слишком мелкие кусочки, нужно найти минимальное подходящее число.\n",
    "\n",
    "Напишите программу, которая помогает найти это число. \n",
    "Программа должна считывать размеры команд (два положительных целых числа a и b, каждое число вводится на отдельной строке) и выводить наименьшее число d, которое делится на оба этих числа без остатка."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#мое, влоб\n",
    "\n",
    "a, b = int(input()), int(input())\n",
    "nok = min(a, b)\n",
    "\n",
    "while True:\n",
    "    if (nok % a == 0) and (nok % b == 0):\n",
    "        break\n",
    "    nok += 1\n",
    "    \n",
    "print(nok)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#чужое, через ИЛИ, с пояснениями\n",
    "\n",
    "a=int(input())\n",
    "b=int(input())\n",
    "m=a\n",
    "if a==b:   # если оба значения (a и b) равны, выводим сразу это значение, и программа завершается.   \n",
    "  print(m)\n",
    "           # иначе, при помощи цикла, прибавляем к одному из значений(a или b) его же значение,\n",
    "else:      # а+а+... или b+b+...до тех пор, пока сумма не будет кратной введенным значениям a и b \n",
    "  while m%a!=0 or m%b!=0: # ТАКОЙ способ позволяет не прерывать цикл. Ниже пояснение.\n",
    "    m=m+a\n",
    "  print(m)\n",
    "\n",
    "     # конструкция m%a!=0 or m%b!=0 - позволяет производить цикл до момента, когда оба условия одновременно\n",
    "     # станут False. Потому что помним(!!!), что цикл While работает только когда условие в нем True, если \n",
    "     # становится False, то блок While перестает работать.\n",
    "        \n",
    "     # То есть, знаем что or - это суммирование(0+0=0, 0+1=1, 1+1=1), and - это умножение (0*0=0, 0*1=0, 1*1=1), \n",
    "     # not - просто меняет значение на противоположное. В нашем примере у нас or. \n",
    "     # Возвращаясь к нашему примеру m%a!=0 or m%b!=0, когда находится общее минимальное делимое число, то? \n",
    "     # результат в условие станет следующий - False и False, то есть, False+False, плюсуем потому что or(помним) \n",
    "     # а значит 0+0=0, а ноль это False, при котором циклл While прекращает свою работу.\n",
    "     # А пока он дошел до этого момента, он пербирал, к примеру, такие варианты, \n",
    "     # как False+True=True, True+False=True, при которых цикл продолжал работать, потому как True."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#от модератора\n",
    "\n",
    "a = int(input())\n",
    "b = int(input())\n",
    "\n",
    "if   a > b:\n",
    "      p = a\n",
    "      while p % b != 0: p += a\n",
    "\n",
    "elif a < b:\n",
    "      p = b\n",
    "      while p % a != 0: p += b\n",
    "\n",
    "else: p = a\n",
    "\n",
    "print (p)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#чужое, через НОД\n",
    "\n",
    "n1, n2 = int(input()), int(input())\n",
    "a = n1\n",
    "b = n2\n",
    "while a != 0 and b !=0:\n",
    "    if a > b:\n",
    "        a = a % b\n",
    "    else:\n",
    "        b = b % a\n",
    "nod = a + b\n",
    "print(int((n1 * n2) / nod))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#чужое, минималистичное\n",
    "\n",
    "a = int(input())\n",
    "b = int(input())\n",
    "d = a\n",
    "while d%b:\n",
    "    d += a\n",
    "print(d)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
