{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Группа биологов в институте биоинформатики завела себе черепашку.\n",
    "\n",
    "После дрессировки черепашка научилась понимать и запоминать указания биологов следующего вида:\n",
    "север 10\n",
    "запад 20\n",
    "юг 30\n",
    "восток 40\n",
    "где первое слово — это направление, в котором должна двигаться черепашка, а число после слова — это положительное расстояние в сантиметрах, которое должна пройти черепашка.\n",
    "\n",
    "Но команды даются быстро, а черепашка ползёт медленно, и программисты догадались, что можно написать программу, которая определит, куда в итоге биологи приведут черепашку. Для этого программисты просят вас написать программу, которая выведет точку, в которой окажется черепашка после всех команд. Для простоты они решили считать, что движение начинается в точке (0, 0), и движение на восток увеличивает первую координату, а на север — вторую.\n",
    "\n",
    "Программе подаётся на вход число команд n, которые нужно выполнить черепашке, после чего n строк с самими командами. Вывести нужно два числа в одну строку: первую и вторую координату конечной точки черепашки. Все координаты целочисленные.\n",
    "\n",
    "Sample Input:\n",
    "4\n",
    "север 10\n",
    "запад 20\n",
    "юг 30\n",
    "восток 40\n",
    "\n",
    "Sample Output:\n",
    "20 -20"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#мое, в лоб\n",
    "\n",
    "def move(direction, value):\n",
    "    x = value*(direction == \"восток\") - value*(direction == \"запад\")\n",
    "    y = value*(direction == \"север\") - value*(direction == \"юг\")\n",
    "    return (x, y)\n",
    "\n",
    "(x, y) = (0, 0)\n",
    "for _ in range(int(input())):\n",
    "    cmnd = input().split()\n",
    "    (tx, ty) = move(cmnd[0], int(cmnd[1]))\n",
    "    x += tx\n",
    "    y += ty\n",
    "    \n",
    "print(x, y)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#от модератора, элегантное\n",
    "\n",
    "cor = {'север': 0, 'восток': 0, 'юг': 0, 'запад': 0}\n",
    "\n",
    "for i in range(int(input())):\n",
    "    s = [j for j in input().split()]\n",
    "    cor[s[0]] += int(s[1])\n",
    "\n",
    "print(cor['восток']-cor['запад'], cor['север']-cor['юг'])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
