{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "35\n",
    "Франция;1;Румыния;1\n",
    "Албания;0;Швейцария;1 \n",
    "Уэльс;2;Словакия;1\n",
    "Англия;1;Россия;1 \n",
    "Турция;0;Хорватия;1\n",
    "Польша;1;Северная Ирландия;0 \n",
    "Германия;2;Украина;0\n",
    "Испания;1;Чехия;0 \n",
    "Бельгия;0;Италия;2\n",
    "Австрия;0;Венгрия;2\n",
    "Португалия;1;Исландия;1 \n",
    "Россия;1;Словакия;2 \n",
    "Румыния;1;Швейцария;1 \n",
    "Франция;2;Албания;0 \n",
    "Англия;2;Уэльс;1 \n",
    "Украина;0;Северная Ирландия;2 \n",
    "Германия;0;Польша;0 \n",
    "Италия;1;Швеция;0\n",
    "Чехия;2;Хорватия;2 \n",
    "Испания;3;Турция;0 \n",
    "Бельгия;3;Ирландия;0 \n",
    "Исландия;1;Венгрия;1 \n",
    "Португалия;0;Австрия;0\n",
    "Швейцария;0;Франция;0 \n",
    "Румыния;0;Албания;1\n",
    "Словакия;0;Англия;0 \n",
    "Россия;0;Уэльс;3 \n",
    "Северная Ирландия;0;Германия;1\n",
    "Украина;0;Польша;1\n",
    "Хорватия;0;Испания;1 \n",
    "Чехия;0;Турция;2\n",
    "Венгрия;0;Португалия;3 \n",
    "Исландия;2;Австрия;1 \n",
    "Швеция;1;Бельгия;1 \n",
    "Италия;2;Ирландия;1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Напишите программу, которая принимает на стандартный вход список игр футбольных команд с результатом матча и выводит на стандартный вывод сводную таблицу результатов всех матчей.\n",
    "\n",
    "За победу команде начисляется 3 очка, за поражение — 0, за ничью — 1.\n",
    "\n",
    "Формат ввода следующий:\n",
    "В первой строке указано целое число n — количество завершенных игр.\n",
    "После этого идет n строк, в которых записаны результаты игры в следующем формате:\n",
    "Первая_команда;Забито_первой_командой;Вторая_команда;Забито_второй_командой\n",
    "\n",
    "Вывод программы необходимо оформить следующим образом:\n",
    "Команда:Всего_игр Побед Ничьих Поражений Всего_очков\n",
    "\n",
    "Порядок вывода команд произвольный.\n",
    "\n",
    "Sample Input:\n",
    "3\n",
    "Зенит;3;Спартак;1\n",
    "Спартак;1;ЦСКА;1\n",
    "ЦСКА;0;Зенит;2\n",
    "\n",
    "Sample Output:\n",
    "Зенит:2 2 0 0 6\n",
    "ЦСКА:2 0 1 1 1\n",
    "Спартак:2 0 1 1 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#мое, лучше чем все, что увидел у других\n",
    "\n",
    "def update_teams(d, team, score1, score2):\n",
    "    \n",
    "    if (team not in d.keys()):\n",
    "        d[team] = [0, 0, 0]\n",
    "    \n",
    "    if (score1 == score2):\n",
    "        d[team][1] += 1\n",
    "    elif (score1 > score2):\n",
    "        d[team][0] += 1\n",
    "    else:\n",
    "        d[team][2] += 1\n",
    "        \n",
    "def print_result(d):\n",
    "    for key in d.keys():\n",
    "        games = sum(d[key])\n",
    "        points = 3*d[key][0] + d[key][1]\n",
    "        print(\"{0}:{1}\".format(key, games), d[key][0], d[key][1], d[key][2], points)\n",
    "    \n",
    "\n",
    "n = int(input())\n",
    "\n",
    "teamsdict = {}\n",
    "\n",
    "for i in range(n):\n",
    "    match = input().split(';')\n",
    "    update_teams(teamsdict, match[0], match[1], match[3])\n",
    "    update_teams(teamsdict, match[2], match[3], match[1])\n",
    "\n",
    "print_result(teamsdict)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#чужое, самое популярное\n",
    "\n",
    "def command(c, res):\n",
    "    if not c in dct: dct[c] = [0, 0, 0, 0, 0]\n",
    "    dct[c] = [dct[c][0] + 1, \n",
    "                dct[c][1] + 1 if res == 3 else dct[c][1],\n",
    "                dct[c][2] + 1 if res == 1 else dct[c][2],\n",
    "                dct[c][3] + 1 if res == 0 else dct[c][3],\n",
    "                dct[c][4] + res,]  \n",
    "dct = {}\n",
    "for i in range(int(input())):\n",
    "    c1, g1, c2, g2 = input().split(';')    \n",
    "    command(c1, 3 if g1 > g2 else 1 if g1 == g2 else 0)\n",
    "    command(c2, 3 if g2 > g1 else 1 if g1 == g2 else 0)\n",
    "for c in dct:\n",
    "    print('{}:{} {} {} {} {}'.format(c, *dct[c]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#чужое, компактное\n",
    "\n",
    "d = {}\n",
    "for a, p, b, v in (input().split(';') for n in range(int(input()))):\n",
    "    d[a] = [i + j for i, j in zip(d.setdefault(a, [0, 0, 0, 0, 0]), [1, (p > v), (p == v), (p < v), 3 if p > v else (p == v)])]\n",
    "    d[b] = [i + j for i, j in zip(d.setdefault(b, [0, 0, 0, 0, 0]), [1, (p < v), (p == v), (p > v), 3 if p < v else (p == v)])]\n",
    "print(*(i+\":\" + ' '.join(map(str, d.get(i))) for i in d), sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
