{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Реализуйте программу, которая будет эмулировать работу с пространствами имен. Необходимо реализовать поддержку создания пространств имен и добавление в них переменных.\n",
    "\n",
    "В данной задаче у каждого пространства имен есть уникальный текстовый идентификатор – его имя.\n",
    "\n",
    "Вашей программе на вход подаются следующие запросы:\n",
    "\n",
    "create <namespace> <parent> –  создать новое пространство имен с именем <namespace> внутри пространства <parent>\n",
    "add <namespace> <var> – добавить в пространство <namespace> переменную <var>\n",
    "get <namespace> <var> – получить имя пространства, из которого будет взята переменная <var> при запросе из пространства <namespace>, или None, если такого пространства не существует\n",
    "\n",
    "Формат входных данных\n",
    "В первой строке дано число n (1 ≤ n ≤ 100) – число запросов.\n",
    "В каждой из следующих n строк дано по одному запросу.\n",
    "Запросы выполняются в порядке, в котором они даны во входных данных.\n",
    "Имена пространства имен и имена переменных представляют из себя строки длины не более 10, состоящие из строчных латинских букв.\n",
    "\n",
    "Формат выходных данных\n",
    "Для каждого запроса get выведите в отдельной строке его результат.\n",
    "\n",
    "Sample Input:\n",
    "9\n",
    "add global a\n",
    "create foo global\n",
    "add foo b\n",
    "get foo a\n",
    "get foo c\n",
    "create bar foo\n",
    "add bar a\n",
    "get bar a\n",
    "get bar b\n",
    "\n",
    "Sample Output:\n",
    "global\n",
    "None\n",
    "bar\n",
    "foo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#мое\n",
    "\n",
    "import os\n",
    "\n",
    "def update_dict(d, a, p):\n",
    "    if p not in d.keys():\n",
    "        update_dict(d, p, 'None')\n",
    "    if a not in d.keys():\n",
    "        d[p][1].append(a)\n",
    "        d[a] = [[],[]]\n",
    "\n",
    "def search_parent_dict(d, a):    #ищет родителя а\n",
    "    for key in d.keys():\n",
    "        if a in d[key][1]:\n",
    "            return key\n",
    "        else:\n",
    "            continue\n",
    "    return None\n",
    "        \n",
    "def search_value_dict(d, a, v):    #ищет val в а\n",
    "    if v in d[a][0]:\n",
    "        return a;\n",
    "    elif a == 'None':\n",
    "        return None\n",
    "    else:\n",
    "        return search_value_dict(d, search_parent_dict(d, a), v)\n",
    "        \n",
    "def simulate(d, cmnd, arg1, arg2):  \n",
    "    \n",
    "    if cmnd=='add':    # добавить в пр-во arg1 переменную arg2\n",
    "        update_dict(d, arg1, 'None')\n",
    "        d[arg1][0].append(arg2)\n",
    "        \n",
    "    if cmnd=='create':    #создать пр-во имен arg1 внутри пр-ва arg2\n",
    "        update_dict(d, arg1, arg2)\n",
    "        \n",
    "    if cmnd=='get':    #получить имя пр-ва из которого будет взята arg2 при вызове из пр-ва arg1\n",
    "        print(search_value_dict(d, arg1, arg2))    \n",
    "        \n",
    "        \n",
    "namespace_dict = {'None' : [[], []]}\n",
    "\n",
    "pathin = os.getcwd()+ '/test.txt'\n",
    "with open(pathin) as file:\n",
    "    file.readline()\n",
    "    for line in file:\n",
    "        try:\n",
    "            cmnd, arg1, arg2 = line.split()\n",
    "            simulate(namespace_dict, cmnd, arg1, arg2)\n",
    "        except:\n",
    "            break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#от модератора\n",
    "\n",
    "n = int(input())\n",
    "\n",
    "parent = {\"global\": None}\n",
    "vs = {\"global\": set()}\n",
    "\n",
    "for _ in range(n):\n",
    "    t, fst, snd = input().split()\n",
    "    if t == \"create\":\n",
    "        parent[fst] = snd\n",
    "        vs[fst] = set()\n",
    "    elif t == \"add\":\n",
    "        vs[fst].add(snd)\n",
    "    else:  # t == get\n",
    "        while fst is not None:\n",
    "            if snd in vs[fst]:\n",
    "                break\n",
    "            fst = parent[fst]\n",
    "        print(fst)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#чужое, с интересными решениями\n",
    "\n",
    "info = dict({'global':[None]})\n",
    "\n",
    "def create(namespace, parent):\n",
    "    info.update({namespace:[parent]})\n",
    "\n",
    "def add(namespace, var):\n",
    "    info[namespace].append(var)\n",
    "\n",
    "def get(namespace, var):\n",
    "    while namespace != None and var not in info[namespace][1:]:\n",
    "        namespace = info[namespace][0]\n",
    "    print(namespace)\n",
    "\n",
    "operations = {'create': create, 'add': add, 'get': get}\n",
    "for i in range(int(input())):\n",
    "    inp = input().split()\n",
    "    operations[inp[0]](inp[1], inp[2])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#чужое, компактное, красивое\n",
    "\n",
    "dct={'global':['None']}                                             # словарь списков(родитель,переменные)\n",
    "for ops, nms, v in [input().split() for i in range(int(input()))]:  # цикл операций(копипаст у Vladmir Ryabov)\n",
    "    if   ops=='create':dct[nms]=[v]                                 # создать пространство-новый список в словаре\n",
    "    elif ops=='add'   :dct[nms].append(v)                           # новая переменная-добавить в список\n",
    "    elif ops=='get':                                                # поиск переменной (циклом)\n",
    "        while nms!='None' and v not in dct[nms]:                    # если нет в пространстве-меняем на родителя(пока не None)\n",
    "            nms=dct[nms][0]                     \n",
    "        print(nms)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
